#!/usr/bin/env python
# encoding: utf-8

"""
@version: 0.1
@author: Kouen
@license: Apache Licence
@email: jobkouen@outlook.com
@software: PyCharm Community Edition
@file: relations.py
@time: 16/7/21 上午11:06
@简介:
    所有内部关系
            u"金": 1, u"水": 2, u"木": 3, u"火": 4, u"土": 0
"""

XING = {
    'MEAN': {
        "X1": {
            u"材": u"金", u"色": u"白",
            u"方": u"西", u"季": u"秋",
            u"时": u"日入", u"节": u"七夕",
            u"星": u"金星", u"声": u"哭",
            u"音": u"商", u"脏": u"肺",
            u"腑": u"大肠", u"体": u"皮",
            u"志": u"悲", u"指": u"无名指",
            u"官": u"鼻", u"觉": u"香",
            u"液": u"涕", u"味": u"辛",
            u"臭": u"腥", u"气": u"气",
            u"荣": u"毛", u"兽": u"白虎",
            u"畜": u"鸡", u"虫": u"哺乳类",
            u"谷": u"粟", u"果": u"桃",
            u"菜": u"葱", u"常": u"义",
            u"经": u"书", u"政": u"力",
            u"恶": u"燥", u"化": u"收",
            u"祀": u"门", u"卦": u"兑",
            u"数": u"9", u"动": u"咳",
            u"病": u"肩背"
        },
        "X2": {
            u"材": u"水", u"色": u"黑",
            u"方": u"北", u"季": u"东",
            u"时": u"夜半", u"节": u"重阳",
            u"星": u"水星", u"声": u"呻",
            u"音": u"羽", u"脏": u"肾",
            u"腑": u"膀胱", u"体": u"骨",
            u"志": u"恐", u"指": u"小指",
            u"官": u"耳", u"觉": u"声",
            u"液": u"唾", u"味": u"咸",
            u"臭": u"朽", u"气": u"骨",
            u"荣": u"发", u"兽": u"玄武",
            u"畜": u"猪", u"虫": u"龟、甲壳类、两栖类",
            u"谷": u"菽", u"果": u"梨",
            u"菜": u"藿", u"常": u"智",
            u"经": u"易", u"政": u"静",
            u"恶": u"寒", u"化": u"藏",
            u"祀": u"井", u"卦": u"坎",
            u"数": u"6", u"动": u"栗",
            u"病": u"腰股"
        },
        "X3": {
            u"材": u"木", u"色": u"青",
            u"方": u"东", u"季": u"春",
            u"时": u"平旦", u"节": u"新年",
            u"星": u"木星", u"声": u"呼",
            u"音": u"角", u"脏": u"肝",
            u"腑": u"胆", u"体": u"筋",
            u"志": u"怒", u"指": u"食指",
            u"官": u"木", u"觉": u"色",
            u"液": u"泣", u"味": u"酸",
            u"臭": u"膻", u"气": u"筋",
            u"荣": u"爪", u"兽": u"青龙",
            u"畜": u"狗", u"虫": u"鱼类、昆虫类、爬虫类",
            u"谷": u"苎麻", u"果": u"李",
            u"菜": u"韭", u"常": u"仁",
            u"经": u"诗", u"政": u"宽",
            u"恶": u"风", u"化": u"生",
            u"祀": u"户", u"卦": u"震",
            u"数": u"8", u"动": u"握",
            u"病": u"颈项"
        },
        "X4": {
            u"材": u"火", u"色": u"赤",
            u"方": u"南", u"季": u"夏",
            u"时": u"日中", u"节": u"上巳",
            u"星": u"火星", u"声": u"笑",
            u"音": u"徵", u"脏": u"心",
            u"腑": u"小肠", u"体": u"脉",
            u"志": u"喜", u"指": u"中指",
            u"官": u"舌", u"觉": u"触",
            u"液": u"汗", u"味": u"苦",
            u"臭": u"焦", u"气": u"血",
            u"荣": u"面", u"兽": u"朱雀",
            u"畜": u"羊", u"虫": u"鸟类",
            u"谷": u"黍", u"果": u"杏",
            u"菜": u"薤", u"常": u"礼",
            u"经": u"礼", u"政": u"明",
            u"恶": u"热", u"化": u"长",
            u"祀": u"灶", u"卦": u"离",
            u"数": u"7", u"动": u"忧",
            u"病": u"胸胁"
        },
        "X0": {
            u"材": u"土", u"色": u"黄",
            u"方": u"中", u"季": u"长夏",
            u"时": u"日西", u"节": u"端午",
            u"星": u"土星", u"声": u"歌",
            u"音": u"宫", u"脏": u"脾",
            u"腑": u"胃", u"体": u"肉",
            u"志": u"思", u"指": u"",
            u"官": u"", u"觉": u"大拇指",
            u"液": u"口", u"味": u"味",
            u"臭": u"香", u"气": u"肉",
            u"荣": u"唇", u"兽": u"勾陈",
            u"畜": u"牛", u"虫": u"人类",
            u"谷": u"稻", u"果": u"枣",
            u"菜": u"葵", u"常": u"信",
            u"经": u"春秋", u"政": u"恭",
            u"恶": u"湿", u"化": u"化",
            u"祀": u"霤", u"卦": u"坤",
            u"数": u"10", u"动": u"哕",
            u"病": u"脊"
        }
    },
    'SON': {
        "X1": "X2", "X2": "X3", "X3": "X4", "X4": "X0", "X0": "X1"
    },
    "WIFE": {
        "X1": "X3", "X2": "X4", "X3": "X0", "X4": "X1", "X0": "X2"
    },
    "HUSBAND": {
        "X1": "X4", "X2": "X0", "X3": "X1", "X4": "X2", "X0": "X3"
    },
    "FATHER": {
        "X1": "X0", "X2": "X1", "X3": "X2", "X4": "X3", "X0": "X4"
    }
}

GAN = {
    'POS': {
        'G1': u'东方', 'G2': u'东方',
        'G3': u'南方', 'G4': u'南方',
        'G5': u'中央', 'G6': u'中央',
        'G7': u'西方', 'G8': u'西方',
        'G9': u'北方', 'G0': u'北方',
    },
    'XING': {
        'G1': u'X3', 'G2': u'X3',
        'G3': u'X4', 'G4': u'X4',
        'G5': u'X0', 'G6': u'X0',
        'G7': u'X1', 'G8': u'X1',
        'G9': u'X2', 'G0': u'X2',
    },
    'YY': {
        'G1': u'阳', 'G2': u'阴',
        'G3': u'阳', 'G4': u'阴',
        'G5': u'阳', 'G6': u'阴',
        'G7': u'阳', 'G8': u'阴',
        'G9': u'阳', 'G0': u'阴',
    },
    "CLASH": {
        'G1': 'G7',
        'G2': 'G8',
        'G3': 'G9',
        'G4': 'G0',
        'G7': 'G1',
        'G8': 'G2',
        'G9': 'G3',
        'G0': 'G4',
    },
    "MERGE": {
        'G1': ('G6', 'X0'),
        'G2': ('G7', 'X1'),
        'G3': ('G8', 'X2'),
        'G4': ('G9', 'X3'),
        'G5': ('G0', 'X4'),
        'G6': ('G1', 'X0'),
        'G7': ('G2', 'X1'),
        'G8': ('G3', 'X2'),
        'G9': ('G4', 'X3'),
        'G0': ('G5', 'X4'),
    }
}

ZHI = {
    "MERGE6": {
        'Z1': ('Z2', 'X0'),
        'Z2': ('Z1', 'X0'),
        'Z3': ('Z0', 'X3'),
        'Z4': ('ZB', 'X4'),
        'Z5': ('ZA', 'X1'),
        'Z6': ('Z9', 'X2'),
        'Z7': ('Z8', 'X0'),
        'Z8': ('Z7', 'X0'),
        'Z9': ('Z6', 'X2'),
        'ZA': ('Z5', 'X1'),
        'ZB': ('Z4', 'X4'),
        'Z0': ('Z3', 'X3'),
    },
    "MERGE3": {
        'Z1': ('Z5', 'Z9', 'X2'),
        'Z2': ('Z6', 'ZA', 'X1'),
        'Z3': ('Z7', 'ZB', 'X4'),
        'Z4': ('Z8', 'Z0', 'X3'),
        'Z5': ('Z1', 'Z9', 'X2'),
        'Z6': ('Z2', 'ZA', 'X1'),
        'Z7': ('Z3', 'ZB', 'X4'),
        'Z8': ('Z4', 'Z0', 'X3'),
        'Z9': ('Z1', 'Z5', 'X2'),
        'ZA': ('Z2', 'Z6', 'X1'),
        'ZB': ('Z3', 'Z7', 'X4'),
        'Z0': ('Z4', 'Z8', 'X3')
    },
    "MEET": {
        'Z0': ('Z1', 'Z2', 'X2'),
        'Z1': ('Z0', 'Z2', 'X2'),
        'Z2': ('Z0', 'Z1', 'X2'),
        'Z3': ('Z4', 'Z5', 'X3'),
        'Z4': ('Z3', 'Z5', 'X3'),
        'Z5': ('Z3', 'Z4', 'X3'),
        'Z6': ('Z7', 'Z8', 'X4'),
        'Z7': ('Z6', 'Z8', 'X4'),
        'Z8': ('Z6', 'Z7', 'X4'),
        'Z9': ('ZA', 'ZB', 'X1'),
        'ZA': ('Z9', 'ZB', 'X1'),
        'ZB': ('Z9', 'ZA', 'X1')
    },
    "DAMAGE": {
        "Z1": "ZA",
        "Z2": "Z5",
        "Z3": "Z0",
        "Z4": "Z7",
        "Z5": "Z2",
        "Z6": "Z9",
        "Z7": "Z4",
        "Z8": "ZB",
        "Z9": "Z6",
        "ZA": "Z1",
        "ZB": "Z8",
        "Z0": "Z3",
    },
    "HURT": {  # 六害, 凶灾死亡,辨别六亲是否被穿坏。
        "Z1": "Z8",
        "Z2": "Z7",
        "Z3": "Z6",
        "Z4": "Z5",
        "Z5": "Z4",
        "Z6": "Z3",
        "Z7": "Z2",
        "Z8": "Z1",
        "Z9": "Z0",
        "ZA": "ZB",
        "ZB": "ZA",
        "Z0": "Z9"
    },
    "PUNISHMENT": {
        "Z3": ("Z6", u"无恩之刑"),
        "Z6": ("Z9", u"无恩之刑"),
        "Z9": ("Z3", u"无恩之刑"),
        "Z8": ("Z2", u"持势之刑"),
        "Z2": ("ZB", u"持势之刑"),
        "ZB": ("Z8", u"持势之刑"),
        "Z1": ("Z4", u"无礼之刑"),
        "Z4": ("Z1", u"无礼之刑"),
        "Z5": ("Z5", u"自刑之刑"),
        "Z7": ("Z7", u"自刑之刑"),
        "ZA": ("ZA", u"自刑之刑"),
        "Z0": ("Z0", u"自刑之刑")
    },
    "CLASH": {  # 六冲
        'Z1': 'Z7',
        'Z2': 'Z8',
        'Z3': 'Z9',
        'Z4': 'ZA',
        'Z5': 'ZB',
        'Z6': 'Z0',
        'Z7': 'Z1',
        'Z8': 'Z2',
        'Z9': 'Z3',
        'ZA': 'Z4',
        'ZB': 'Z5',
        'Z0': 'Z6'
    },
    "AnMerge": {  # 证婚期、桃花运、和得贵人助力
        "Z2": "Z3",
        "Z3": "Z2",
        "Z7": "Z0",
        "Z0": "Z7",
        "Z4": "Z9",
        "Z9": "Z4"
    },
    "XING": {
        'Z1': 'X2',
        'Z2': 'X0',
        'Z3': 'X3',
        'Z4': 'X3',
        'Z5': 'X0',
        'Z6': 'X4',
        'Z7': 'X4',
        'Z8': 'X0',
        'Z9': 'X1',
        'ZA': 'X1',
        'ZB': 'X0',
        'Z0': 'X2'
    }
}

GOD10 = {}

QUARTER = {
    'Z3': {  # 旺 相 休 死 囚
        '4J': ('X3', 'X4', 'X2', 'X1', 'X0'),
        '5X': (
            ('X3', 0),
            ('X4', 2),
            ('X0', 0),
            ('X2', -2)
        )
    },
    'Z4': {
        '4J': ('X3', 'X4', 'X2', 'X1', 'X0'),
        '5X': (
            ('X3', 0),
            ('X4', 2),
            ('X0', 0),
            ('X2', -2)
        )
    },
    'Z5': {
        '4J': ('X0', 'X1', 'X4', 'X3', 'X2'),
        '5X': (
            ('X3', 0),
            ('X4', 2),
            ('X0', 0),
            ('X2', -2)
        )
    },
    'Z6': {
        '4J': ('X4', 'X0', 'X3', 'X2', 'X1'),
        '5X': (
            ('X3', 0),
            ('X4', -2),
            ('X0', -2),
            ('X2', 2)
        )
    },
    'Z7': {
        '4J': ('X4', 'X0', 'X3', 'X2', 'X1'),
        '5X': (
            ('X3', 0),
            ('X4', -2),
            ('X0', -2),
            ('X2', 2)
        )
    },
    'Z8': {
        '4J': ('X0', 'X1', 'X4', 'X3', 'X2'),
        '5X': (
            ('X3', 0),
            ('X4', -2),
            ('X0', -2),
            ('X2', 2)
        )
    },
    'Z9': {
        '4J': ('X1', 'X2', 'X0', 'X4', 'X3'),
        '5X': (
            ('X4', -2),
            ('X0', 0),
            ('X2', 2)
        )
    },
    'ZA': {
        '4J': ('X1', 'X2', 'X0', 'X4', 'X3'),
        '5X': (
            ('X4', -2),
            ('X0', 0),
            ('X2', 2)
        )
    },
    'ZB': {
        '4J': ('X0', 'X1', 'X4', 'X3', 'X2'),
        '5X': (
            ('X4', -2),
            ('X0', 0),
            ('X2', 2)
        )
    },
    'Z0': {
        '4J': ('X2', 'X3', 'X1', 'X0', 'X4'),
        '5X': (
            ('X1', -2),
            ('X2', -2),
            ('X0', 0),
            ('X4', 2)
        )
    },
    'Z1': {
        '4J': ('X2', 'X3', 'X1', 'X0', 'X4'),
        '5X': (
            ('X1', -2),
            ('X2', -2),
            ('X0', 0),
            ('X4', 2)
        )
    },
    'Z2': {
        '4J': ('X0', 'X1', 'X4', 'X3', 'X2'),
        '5X': (
            ('X1', -2),
            ('X2', -2),
            ('X0', 0),
            ('X4', 2)
        )
    }
}

DICT = {
    "ID": {
        'X1': u"金",
        'X2': u"水",
        'X3': u"木",
        'X4': u"火",
        'X0': u"土",
        'G1': u"甲",
        'G2': u"乙",
        'G3': u"丙",
        'G4': u"丁",
        'G5': u"戊",
        'G6': u"己",
        'G7': u"庚",
        'G8': u"辛",
        'G9': u"壬",
        'G0': u"癸",
        'Z1': u"子",
        'Z2': u"丑",
        'Z3': u"寅",
        'Z4': u"卯",
        'Z5': u"辰",
        'Z6': u"巳",
        'Z7': u"午",
        'Z8': u"未",
        'Z9': u"申",
        'ZA': u"酉",
        'ZB': u"戌",
        'Z0': u"亥",
    },
    "NAME": {
        u"金": 'X1',
        u"水": 'X2',
        u"木": 'X3',
        u"火": 'X4',
        u"土": 'X0',
        u"甲": 'G1',
        u"乙": 'G2',
        u"丙": 'G3',
        u"丁": 'G4',
        u"戊": 'G5',
        u"己": 'G6',
        u"庚": 'G7',
        u"辛": 'G8',
        u"壬": 'G9',
        u"癸": 'G0',
        u"子": 'Z1',
        u"丑": 'Z2',
        u"寅": 'Z3',
        u"卯": 'Z4',
        u"辰": 'Z5',
        u"巳": 'Z6',
        u"午": 'Z7',
        u"未": 'Z8',
        u"申": 'Z9',
        u"酉": 'ZA',
        u"戌": 'ZB',
        u"亥": 'Z0',
    }
}

JIEQI = {
    1: u"立春",
    u"立春": 1,
    2: u"雨水",
    u"雨水": 2,
    3: u"惊蛰",
    u"惊蛰": 3,
    4: u"春分",
    u"春分": 4,
    5: u"清明",
    u"清明": 5,
    6: u"谷雨",
    u"谷雨": 6,
    7: u"立夏",
    u"立夏": 7,
    8: u"小满",
    u"小满": 8,
    9: u"芒种",
    u"芒种": 9,
    10: u"夏至",
    u"夏至": 10,
    11: u"小暑",
    u"小暑": 11,
    12: u"大暑",
    u"大暑": 12,
    13: u"立秋",
    u"立秋": 13,
    14: u"处暑",
    u"处暑": 14,
    15: u"白露",
    u"白露": 15,
    16: u"秋分",
    u"秋分": 16,
    17: u"寒露",
    u"寒露": 17,
    18: u"霜降",
    u"霜降": 18,
    19: u"立冬",
    u"立冬": 19,
    20: u"小雪",
    u"小雪": 20,
    21: u"大雪",
    u"大雪": 21,
    22: u"冬至",
    u"冬至": 22,
    23: u"小寒",
    u"小寒": 23,
    24: u"大寒",
    u"大寒": 24,
}